app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories" WHERE (user_id = 1) ORDER BY "categories"."id" ASC LIMIT ? OFFSET ?  [["LIMIT", 9], ["OFFSET", 0]]
SELECT COUNT(*) FROM "categories" WHERE (user_id = 1)
---
  def index
    @categories = Category.all.where('user_id = ?', current_user.id).order(:id).page params[:page]

INSERT INTO "categories" ("name", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["name", "2222"], ["description", "wow"], ["created_at", "2023-02-19 12:15:43.047455"], ["updated_at", "2023-02-19 12:15:43.047455"], ["user_id", 1]]
---
  def create
    @category = Category.new(category_params)
    @category.user_id = current_user.id

    respond_to do |format|
      if @category.save

SELECT "operations".* FROM "operations" WHERE (user_id = 1 and category_id = 4) ORDER BY odate DESC LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
---
  def show_operations
    @operations = Operation.all.where("user_id = ? and category_id = ?", current_user.id, @category).order('odate DESC').page params[:page]