app/controllers/main_controller.rb

SELECT "operations".* FROM "operations" WHERE (user_id = 1 AND income = 0) ORDER BY "operations"."odate" DESC LIMIT ?  [["LIMIT", 10]]
---
  def index
    if user_signed_in?
      @operations = Operation.where('user_id = ? AND income = ?', current_user.id, false)
                    .order(:odate).last(10).reverse