app/controllers/operations_controller.rb

SELECT "operations".* FROM "operations" WHERE (user_id = 1 AND income = false) ORDER BY odate DESC LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
---
  def index()
    if params[:o_type] == 'income'
      @operations = Operation.all.where("user_id = ? AND income =  true", current_user.id).order('odate DESC').page params[:page]

INSERT INTO "operations" ("amount", "odate", "description", "category_id", "created_at", "updated_at", "user_id", "income") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @operation = Operation.new(operation_params)
    @operation.user_id = current_user.id

    respond_to do |format|
      if @operation.save

UPDATE "operations" SET "description" = ?, "updated_at" = ? WHERE "operations"."id" = ?  [["description", "bas s basslsnflsdk"], ["updated_at", "2023-02-17 14:37:55.232501"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @operation.update(operation_params)

DELETE FROM "operations" WHERE "operations"."id" = ?  [["id", 1]]
---
  def destroy
    @operation.destroy

SELECT "operations".* FROM "operations" WHERE "operations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_operation
      @operation = Operation.find(params[:id])