app/views/operations/_form.html.erb

SELECT "categories".* FROM "categories" WHERE (user_id = 1)
---
          <%= form.label t('operations.form.category'), style: "display: block"%>
          <% categories_array = Category.all.where('user_id = ?', current_user.id).map { | cat | [cat.name, cat.id]} %>