app/views/operations/_operation.html.erb

SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---

      <div><%= Category.find(operation.category_id).name %></div><br><br>